IDEA StatiCa Open Model
CutBeamByBeamData.CuttingObject Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Cutting by object
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public ReferenceElement CuttingObject { get; set; }
Public Property CuttingObject As ReferenceElement
	Get
	Set
public:
property ReferenceElement^ CuttingObject {
	ReferenceElement^ get ();
	void set (ReferenceElement^ value);
}
Property Value
Type: ReferenceElement
See Also
Reference
CutBeamByBeamData Class
IdeaRS.OpenModel.Connection Namespace